start = (
    "سلام👋 {username} عزیز خوش اومدید. \n\n"
    "😎به کمک این ربات می‌تونید چند تا کار بکنید:\n\n"
    "1. می‌تونید صداتون رو به صدای گوینده‌های حرفه‌ای، شخصیت‌های فیلم‌ها و انیمیشن‌ها و افراد مشهور تبدیل کنید.\n"
    "2. می‌تونید صدای خواننده رو از صدای موزیک یک آهنگ جدا کنید (اگر می‌خواید خواننده یک موزیک رو عوض کنید، این گزینه به کارتون میاد)\n\n"
    "✅برای شروع کافیه که یه ویس یا فایل صوتی برای من ارسال کنید. \n\n"
    "‼️توجه داشته باشید که برای خروجی بهتر بخش تقلید صدا لازمه که صدایی که ارسال می‌کنید بدون نویز یا سر و صدای اضافی باشد."
)
gift_msg = "🎁 {inital_credits} ثانیه اعتبار هدیه به شما تعلق گرفت. \n\n"
joined_channels_btn = ["✅ عضو شدم", "callback", "joined_channels", 0]
join_channels = (
    "🔻لطفا برای شروع در کانالهای زیر عضو شوید و روی دکمه عضو شدم کلیک کنید\n"
)
voice_select = "🎭 لطفا صدای مورد نظر خود را برای تبدیل انتخاب کنید\n\n**برای شنیدن نمونه صداها : /list**"
pitch_select = """
🎙 تنظیم زیر و بمی صدا

📌در صورتیکه نیاز دارید صدای خروجی، بم‌تر یا زیرتر باشد، لطفا یکی از گزینه‌های زیر را انتخاب کنید

🔍 پیشنهاد می‌شود در ابتدا با گزینه **پیش‌فرض** یک صدا تولید کنید و بعد برای شباهت هر چه بیشتر به صدای انتخاب شده، زیر و بمی صدا را تغییر دهید.

"""
pitch_btns = [
    # ["🗣 تبدیل صدای زنانه به مردانه", "callback", "pitch_-12", 0],
    # ["🔻 بم+9", "callback", "pitch_-9", 1],
    ["🔺 بم‌تر", "callback", "pitch_-3", 1],
    ["🔺 خیلی بم‌تر", "callback", "pitch_-6", 1],
    ["🔸 بدون تغییر | پیش‌فرض", "callback", "pitch_0", 2],
    # ["🔺 زیر+9", "callback", "pitch_9", 3],
    ["🔻 زیرتر", "callback", "pitch_3", 3],
    ["🔻 خیلی زیرتر", "callback", "pitch_6", 3],
    # ["🧔‍♀️ تبدیل صدای مردانه به زنانه", "callback", "pitch_12", 4],
]
proccessing_emojie = "⏳"
proccessing = (
    "🔄در حال پردازش درخواست شما ...\n\n"
    "اعتبار مصرف شده برای این درخواست : **{used_credits} ثانیه**\n\n"
    "**🔸 اعتبار باقی‌مانده شما: {credits} ثانیه**\n\n"
    # "بازگشت به منوی اصلی : /menu"
)
proccessing_queue = (
    "🔄 درخواست شما در صف پردازش قرار گرفت...\n\n"
    "📊 شما نفر {queue}ام در صف پردازش هستید\n\n"
    "💰 اعتبار مصرف شده برای این درخواست : **{used_credits} ثانیه**\n\n"
    "**🔸 اعتبار باقی‌مانده شما: {credits} ثانیه**\n\n"
    "✨ کاربرانیکه اعتبار ویژه تهیه کرده‌اند در صف پردازش نمی‌گیرند. خرید اعتبار : /buy_credits"
    # "بازگشت به منوی اصلی : /menu"
)
no_credits = """
‼️ اعتبار شما برای این درخواست کافی نیست.

**💰 برای افزایش اعتبار:**
🔹 از دستور /buy_credits استفاده کنید.
🎁 یا با /invite دوستانتان را به ربات دعوت کنید و اعتبار هدیه بگیرید!"""
banner_msg = """
🔥ربات تقلید صدای هوش‌مصنوعی

😍با استفاده از این ربات می‌تونی صدات رو به صدای گوینده‌های حرفه‌ای، شخصیت‌های فیلم‌ها و انیمیشن‌ها و حتی افراد مشهور تبدیل کنی.

🎙بعضی از صداهای موجود : 
🔻 راوی راز بقا
🔻 پاندی کونگ‌ فو کار
🔻 شرک
🔻 فردوسی پور
🔻محسن چاوشی
و کلی صدای جذاب دیگه

✅همین الان می‌تونی از لینک زیر واردش بشی و یه ویس براش بفرستی تا برات تقلیدش کنه:"""

invite_help = (
    "🎁 با ارسال پیام بالا به دوستانتان می‌توانید اعتبار هدیه دریافت کنید.\n\n"
    "🔸 تعداد دعوت‌های موفق شما: **{refs}**\n\n"
    "🔗 لینک دعوت شما:\n{invite_link}\n\n"
    "🔸 اعتبار  باقیمانده شما: **{credits} ثانیه**\n\n"
    "✅ به ازای هر دعوت موفق، **{invitation_gift} ثانیه** اعتبار رایگان دریافت می‌کنید.\n\n"
)

invitation_gift = 40
initial_gift = 60
credits_message = (
    "🔸 اعتبار باقیمانده شما: **{credits} ثانیه**\n\n📱 خرید اشتراک : /buy_credits \n\n"
    # "⬅️ بازگشت به منوی اصلی : /menu"
)
categories_lable = {
    "celebritie": "👥 چهره‌های مشهور",
    "singer": "🎤 خوانندگان",
    "voice_actor": "🎙️ گویندگان",
    "character": "🦸 شخصیت‌ها",
    "actor": "🎭 بازیگران",
}
select_category = "🎭 لطفا یکی از صداها را انتخاب کنید"
category_header = "--==🔻{category}  | تعداد صداها: {count} 🔻==--"
menu_msg = "خوش آمدید، لطفا یک گزینه را انتخاب کنید : "
menu_btns = [
    ["💰 خرید اعتبار", "callback", "buy_credits", 0],
    ["🎙️ تقلید صدا", "callback", "convert_voice", 0],
    ["🎧 نمونه صوتی صداهای موجود", "callback", "list", 1],
    ["🎙 جداسازی صدا از آهنگ", "callback", "vocal_remover", 2],
    ["📖 راهنما", "callback", "help", 3],
    ["🎁 دعوت از دوستان", "callback", "invite", 3],
]
help_msg = """
🚦 راهنمای استفاده از ربات تقلید صدای Neda AI

🎙 این ربات می‌تونه صدای شما رو به صدای گوینده‌های حرفه‌ای، افراد مشهور، کاراکترهای فیلم و سریال و انیمیشن و خواننده‌های مطرح تبدیل کنه.

🎤 یا می‌تونه صدای خواننده رو از یک آهنگ جدا کنه. بعدش می‌تونید با قابلیت تقلید صدای همین ربات، صدای خواننده یک آهنگ رو تغییر بدید.

📌 از Nedaai می‌تونید برای ساختن محتواهای جذاب، نَرِیشن و گویندگی ویدیوهای تبلیغاتی استفاده کنید و یک ویدیوی درگیرکننده بسازید.

🎤 برای استفاده از این ربات کافیه که یک ویس یا فایل صوتی براش بفرستید و از بین گزینه صداهای موجود یکی رو انتخاب کنید.

👈در ادامه ربات ازتون در خصوص تنظیمات زیری و بمی صدای نهایی می‌پرسه که باید با توجه به صدای ورودی و صدای انتخابی، تنظیمات درست رو برای صداتون پیدا کنید.

- مثلا اگه صدایی که فرستادید به نسبت بم‌تر از صداییه که برای تبدیل شدن انتخاب کردید باید از گزینه‌های زیرتر کردن صدا استفاده کنید.

- در ادامه ربات براتون ویس ساخته شده با صدای جدید رو می‌فرسته و می‌تونید ذخیره‌اش کنید و تو جاهای مختلف استفاده کنید.

❓ اگه سوالی داشتید می‌تونید از @nedaaisupport بپرسید
"""
convert_msg = """
✅برای شروع کافیه که یه ویس یا فایل صوتی 15 ثانیه به بالا برای من ارسال کنید. 

‼️توجه داشته باشید که برای خروجی بهتر لازمه که صدایی که ارسال می‌کنید بدون نویز یا سر و صدای اضافی باشد.

با خرید اشتراک این محدودیت به 5 ثانیه کاهش می‌یابد. برای خرید اشتراک : /buy_credits

"""
vocal_remove_msg = """
✅برای شروع کافیه که یه آهنگ 30 ثانیه به بالا برای من ارسال کنید. 

در ادامه من صدای خواننده رو از صدای موزیک اون آهنگ جدا می‌کنم و برات می‌فرستم. به این شکل می‌تونی با ارسال دوباره صدای خواننده به من، صدای خواننده اون آهنگ رو به شخص دیگری تغییر بدی

این قابلیت موقتا غیر فعال است
"""
admin_id = 791927771
admin_username = "@nedaaisupport"
return_to_menu_button = ["بازگشت به منوی اصلی", "callback", "menu", 0]
error_message = (
    "❌ دستور وارد شده معتبر نیست، برای ورود به منوی اصلی روی /menu کلیک کنید\n\n"
    "🎤 برای تقلید صدا، لطفا یک ویس یا فایل صوتی ارسال کنید"
)
t40_price = 0.000225  # per second
invite_successfully = (
    "✨ کاربر {user} با لینک دعوت شما وارد ربات شد.\n\n"
    "🎁 {gift_credits} ثانیه اعتبار به شما تعلق گرفت.\n\n"
)
channels_list = ["@nedaaiofficial"]
banner_img_id = "AgACAgQAAxkBAAILAmeVA8R4YjsLLh42tnXV2lfsUHX4AAJZxjEbdYGpUAjaRPN3EpG6AAgBAAMCAAN5AAceBA"
gender_select = """
👥 لطفا جنسیت صدای ورودی خود را انتخاب کنید:
"""
gender_btns = [
    ["👩 زن", "callback", "gender_female", 0],
    ["👨 مرد", "callback", "gender_male", 0],
]
added_credits = (
    "✨ کاربر گرامی، {credits} ثانیه اعتبار به حساب شما اضافه شد.\n\n"
    "🔸 اعتبار باقیمانده شما : {new_credits}"
)
task_msg = """
🎤 چه کاری براتون انجام بدم؟

👈برای تبدیل صدای ارسال شده به صدای افراد مختلف، گزینه «تقلید صدا» رو انتخاب کنید

👈برای جدا کردن صدای خواننده یک آهنگ از موزیک و سازهای اون آهنگ از گزینه «جداسازی صدا از آهنگ» استفاده کنید. این قابلیت موقتا غیرفعال است
"""
task_btns = [
    ["🔊 تقلید صدا", "callback", "task_voice_changer", 0],
    # ["🎙 جداسازی صدا از آهنگ (غیرفعال)", "callback", "none", 1],
]
bot_id = 7760580398
short_audio = """⛔️ ویس ورودی شما نباید  کمتر از {limit} ثانیه باشد

برای رفع محدودیت می‌توانید اقدام به خرید اعتبار ویژه کنید. سفارش : /buy_credits"""
short_audio_paid = "⛔️ ویس ورودی شما نباید  کمتر از {limit} ثانیه باشد"
short_audio_for_vocal_remove = "⛔️ آهنگ ورودی شما نباید  کمتر از {limit} ثانیه باشد"
convert_limit = 15
convert_limit_paid = 5
vocal_remove_limit = 60
vocal_remove_limit_paid = 30
uploading_file = "🔄 در حال آپلود فایل..."
unknown_error = "خطایی ناشناخته رخ داد مجددا تلاش کنید!"
user_not_exists = "‼️ شما هنوز در ربات ما عضو نشدید، برای شروع روی /start کلیک کنید."
already_inqueue = """‼️ شما یک درخواست در حال پردازش دارید، تا اتمام پردازش درخواست قبلی نمی‌توانید درخواست جدیدی ارسال کنید. ⏳

برای برداشتن محدودیت درخواست‌های همزمان، می‌توانید از طریق دستور /buy_credits اعتبار ویژه خریداری کنید. 💳"""

buy_credits_message = (
    # "💰 خرید اعتبار\n\n"
    "🔸 اعتبار باقیمانده شما: **{credits} ثانیه**\n\n"
    "**📩 جهت اطلاع از قیمت‌ها و خرید اشتراک ربات تقلید صدا وارد این کانال شوید : @nedaaisub\n\n**"
    "✨ با خرید اشتراک، بدون محدودیت در صف پردازش از ربات استفاده کنید!"
)

prices = {
    "15": 99000,  # 100
    "30": 190000,  # 200
    "60": 375000,  # 400
    "120": 745000,  # 800
    "180": 1100000,  # 1200
}

buy_credits_btn = [
    [
        "💳 بسته 15 دقیقه‌ای",
        "url",
        "https://t.me/nedaaisupport?text=سلام، میخوام بسته 15 دقیقه‌ای ربات تقلید صدا رو بخرم",
        0,
    ],
    [
        "💳 بسته 30 دقیقه‌ای",
        "url",
        "https://t.me/nedaaisupport?text=سلام، میخوام بسته 30 دقیقه‌ای ربات تقلید صدا رو بخرم",
        1,
    ],
    [
        "💳 بسته 60 دقیقه‌ای",
        "url",
        "https://t.me/nedaaisupport?text=سلام، میخوام بسته 60 دقیقه‌ای ربات تقلید صدا رو بخرم",
        2,
    ],
    [
        "💳 بسته 120 دقیقه‌ای",
        "url",
        "https://t.me/nedaaisupport?text=سلام، میخوام بسته 120 دقیقه‌ای ربات تقلید صدا رو بخرم",
        3,
    ],
    [
        "💳 بسته 180 دقیقه‌ای",
        "url",
        "https://t.me/nedaaisupport?text=سلام، میخوام بسته 180 دقیقه‌ای ربات تقلید صدا رو بخرم",
        4,
    ],
    ["⬅️بازگشت به منوی اصلی", "callback", "menu", 5],
]


go_to_support_btn = [
    [
        "💳 خرید اعتبار ویژه",
        "url",
        "t.me/nedaaisupport",
        0,
    ],
    ["⬅️بازگشت به منوی اصلی", "callback", "menu", 5],
]
go_to_shop_btn = [
    [
        "💳 خرید اعتبار ویژه",
        "url",
        "https://t.me/nedaaisub",
        0,
    ],
    ["⬅️بازگشت به منوی اصلی", "callback", "menu", 1],
]
voice_list_btn = [
    ["🎧 نمونه‌های صوتی Neda AI", "url", "https://t.me/nedaaiofficial/46", 0],
    ["⬅️بازگشت به منوی اصلی", "callback", "menu", 1],
]

list_msg = """
**🎙برای شنیدن نمونه صدای مدل‌های موجود ربات نِدا روی دکمه زیر کلیک کنید.**"""